# St7SetPlateLabelStyle

Sets the display style for plate labels.

long St7SetPlateLabelStyle(long uID, long LabelStyle)

Input Parameters

uID

Strand7 model file ID.

LabelStyle

One of lsNone, lsEntityNumber, lsIDNumber, lsPropertyNumber, lsPropertyName or lsPropertyType.

Strand7 API Manual

Dependencies
Font

Assigned using St7SetEntityFont.